Revit 2024 API
UpdaterRegistry.IsUpdaterRegistered Method (UpdaterId, Document)
 Checks whether updater with the given id is registered in a document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static bool IsUpdaterRegistered(
	UpdaterId id,
	Document document
)
Visual Basic
Public Shared Function IsUpdaterRegistered ( _
	id As UpdaterId, _
	document As Document _
) As Boolean
Visual C++
public:
static bool IsUpdaterRegistered(
	UpdaterId^ id,
	Document^ document
)
Parameters
id
Type: Autodesk.Revit.DB.UpdaterId
 Id of the updater being tested.
document
Type: Autodesk.Revit.DB.Document
 Document in which this updater is tested whether it's registered or not.
Return Value
 Returns True if the updater is registered in the given document.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
UpdaterRegistry Class
IsUpdaterRegistered Overload
Autodesk.Revit.DB Namespace